/*Задание 3. Через do-while запросить температуру отопления от 15 до 30.
Повторять ввод до корректного значения,
затем вывести отклонение от рекомендуемых 22 градусов.*/

#include <iostream>
using namespace std;

int main() {
	double t, mod;
	setlocale(LC_ALL, "");
	do {
		cout << "";
		cin >> t;
	} while (t < 15 || t > 30);
	
	if (t > 22)
		cout << "температура отличается на " << t - 22 << "°";
	else if (t < 22)
		cout << "температура отличается на " << 22 - t << "°";
	else
		cout << "Температура идеальна!";

	return 0;
}